# Многострочность.

# Напишите программу, которая создает и выводит на экран строки, объявленные различными способами:
# Строку с использованием одинарных кавычек.
# Строку с использованием двойных кавычек.
# Многострочную строку с использованием тройных кавычек.

# Напишите тут ваш код
str1 = 'Hello'
str2 = "World"
str3 = """ Blaaasjdas
asfasdadsasds
asdasdasdasdsad
asdadsadasdsaad"""

print(str1)
print(str2)
print(str3)
