# Экранирование

# Напишите программу, которая создает и выводит на экран строки:
# Строку с вложенными кавычками с использованием разных типов кавычек.
# Строку с вложенными кавычками с использованием экранирования.

# Напишите тут ваш код
str1 = "String with 'strokes' and others"
str2 = "String with \"escaped\" and others"
print(str1)
print(str2)