# Произвольная программа

# Напишите программу, которая создает список из произвольных элементов, выводит длину списка, а затем первый и последний элемент списка.

# Напишите тут ваш код
my_list = [1, 2, "apple", "grape", 23]
print(len(my_list))
print(my_list[0])
print(my_list[-1])
