# Негатив

# Напишите программу, которая запрашивает у пользователя число и проверяет, является ли оно отрицательным.
# Используйте оператор if для проверки.

# Напишите тут ваш код
num = int(input("Add number: "))
if num < 0:
    print(True)
else:
    print(False)