import math
# Математика 8 класса

# Напишите программу, которая запрашивает у пользователя число и использует библиотеку math для вычисления и вывода квадратного корня и факториала этого числа.

# Напишите тут ваш код
num = int(input("Enter the number: "))
print(math.sqrt(num), math.factorial(num))
