# Кормен

# Выведите на экран текст "Кормен - красавчик"

print('Кормен - красавчик')
