# Мой любимый список

# Напишите программу, которая создает динамический массив (список)
# и демонстрирует его основные операции: добавление, удаление, доступ по индексу и изменение элемента.
# Класс list использовать можно.

# Напишите тут ваш код
matrix = []
matrix.append(1)
matrix.append(2)
matrix.append(3)
matrix.append(4)

matrix.remove(3)

print(matrix[1])
matrix[1] = 5