# Использование пакета cowsay
import cowsay
# Установите пакет cowsay и используйте его для отображения сообщения.
# Выполните следующие шаги:
# Установите пакет cowsay с помощью pip.
# Используйте пакет cowsay для отображения сообщения "Нужно было учить Python...".
# Удалите пакет cowsay с помощью pip.


# Установка пакета cowsay
cowsay.cow("Нужно было учить Python...")
# cowsay.dragon("I am a dragon")

# Использование пакета cowsay для отображения сообщения
# Напишите тут ваш код

# Удаление пакета cowsay
# Напишите тут ваш код