# Семицветик

# Напишите программу, которая создает множество из 7 элементов - названий цветов (color).
# Программа должна вывести все элементы созданного множества на экран.

# Напишите тут ваш код
colors = {"white", "red", "blue", "yellow", "green", "brown", "black"}
# print(type(colors))
print(colors)