# Запаковка

# Напиши программу, которая содержит словарь, который содержит список, который содержит словарь, который содержит список, который содержит строку.

# Напишите тут ваш код
# blist = ("horse", "cow")
mylist = ["apple", "banana", "cherry"]
# slv = {"animal":blist, 2:"ths"}
text = "Something and"
slv2 = {1: ["as", "sda", "4", text], 4: mylist, 5: text, 6: 'hjghgjgjg'}
alist = ["dog", "cat", text, slv2]
slovar = {1: "smth", 2: "other", 3: alist, 4: slv2}
# print(type(slv))
print(type(alist))
print(slovar)
