# Пересечение имен.
import ru. javarush. python. core. level11.task17.math
from ru.javarush.python.core.level11.task17 import math
from math import sqrt
# Вызовите функцию sqrt вашего модуля math.
# Вызовите функцию sqrt встроенного модуля math.

# Напишите тут ваш код
print(sqrt(25))
# g(9)
sqrt(9)
