# Тернарный оператор

# Напишите программу, которая запрашивает у пользователя число и использует тернарный оператор для проверки, является ли оно четным или нечетным.
# Выведите соответствующее сообщение.

# Напишите тут ваш код
num = int(input("Number: "))
answer = "четный" if num % 2 == 0 else "нечетный"
print(answer)
