# Циклотрон

# Напишите программу, которая вычисляет и выводит сумму всех чисел от 1 до 100 включительно, используя цикл for и функцию range().

# Напишите тут ваш код
summa = 0
for num in range(1, 101):
    summa += num
print(summa)
