# Грокаем алгоритмы

# Выведите на экран текст "Кормен - красавчик, но читать я его конечно же не буду".

print("Кормен - красавчик, но читать я его конечно же не буду")