# Ошибка с отступами.

# Напиши программу, которая создает исключение IndentationError

# Напишите тут ваш код
def func():
 print("dfdf")
   print("aga")

if True:
  func()