# Просто и сложно одновременно

# Создай 5 кортежей с разной длинной: 0 элементов, 1 элемент, 5 элементов, 100 элементов, 1000 элементов.
# Выведи их на экран.

# Напишите тут ваш код
atuple = ()
btuple = ('sdd',)
ctuple = (1, 2, "salom", 3, "y")
list100 = [x for x in range(100)]
dtuple = tuple(list100)
list1000 = [x for x in range(1000)]
etuple = tuple(list1000)
print(atuple)
print(btuple)
print(ctuple)
print(dtuple)
print(etuple)
