# Извлечение подстрок.

# Напишите программу, которая принимает строку от пользователя и извлекает из нее подстроки с использованием срезов.
# Программа должна:
# Извлечь подстроку с 3-го по 8-й символ включительно.
# Извлечь подстроку с 5-го символа до конца строки.
# Вывести обе подстроки.

# Напишите тут ваш код
text = input("enter the text: ")
print(text[3:9])
print(text[5:])
