# Распаковка

# Напишите программу, которая создает кортеж из 3 элементов (например, имя, возраст, город).
# Затем программа должна распаковать кортеж в отдельные переменные и вывести каждую переменную.

# Напишите тут ваш код
my_tuple = ("Dominic", 40, "Tashkent")
name, age, city = my_tuple
print(name, age, city)