# Создание множеств.

# Напиши программу, которая создает 5 множеств:
# множество с 0 элементов,
# множество с 1 элементом,
# множество с 5 элементами,
# множество с 100 элементами,
# множество с 1000 элементами

# Напишите тут ваш код
aset = set()
bset = {'sdd'}
cset = {1, 2, 4, 3, 5}
list100 = [x for x in range(100)]
dset = set(list100)
list1000 = [x for x in range(1000)]
eset = set(list1000)
print(aset)
print(bset)
print(cset)
print(dset)
print(eset)