# Все не так однозначно.

# Напиши программу, которая делит целое число на целое.
# Выведи на экран тип результата.

# Напишите тут ваш код
print(type(7/3))
