# Использование пакета requests.
import requests
# Используйте пакет requests для выполнения GET-запроса к API.
# Выполните следующие шаги:
# Установите пакет requests с помощью pip.
# Используйте пакет requests для выполнения GET-запроса к API, например, к https://jsonplaceholder.typicode.com.
# Выведите на экран результат запроса.
abs = requests.get("https://jsonplaceholder.typicode.com")
print(abs)

